"""Написати клас "Банківський рахунок" (Account), який містить:

Номер рахунку
Розмір коштів на рахунку
Назва валюти рахунку (рублі, гривні, евро тощо), для позначення якої можна скористатись одним символом: R, G, E, $ тощо
Забезпечити можливість:

Відкривати рахунок та первинно вносити гроші на рахунок
Знімати гроші з рахунку
Докладати гроші на рахунок
ПРИМІТКА! На 12 балів реалізувати також можливість здійснювати переказ грошей з одного рахунку на другий."""

from lib.Account import Account

card1 = Account(1000, 'G')
print(card1.number, card1.sum, card1.currency)

card1.put_money(250)
print(card1.number, card1.sum, card1.currency)

card1.take_money(250)
print(card1.number, card1.sum, card1.currency)
